fio4pi/results/6407-8r-rpi3-raspbian_v4.1.18-v7+.log
random-read-1: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-2: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-3: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-4: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-5: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-6: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-7: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-8: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 8 processes
random-read-7: Laying out IO file(s) (1 file(s) / 128MB)
random-read-8: Laying out IO file(s) (1 file(s) / 128MB)

random-read-1: (groupid=0, jobs=1): err= 0: pid=4419: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=667919B/s, iops=163, runt=200949msec
    clat (usec): min=1652, max=25904, avg=6119.11, stdev=402.64
     lat (usec): min=1653, max=25905, avg=6120.01, stdev=402.64
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8256], 99.95th=[ 8640],
     | 99.99th=[16192]
    bw (KB  /s): min=  522, max=  690, per=12.50%, avg=652.31, stdev=11.38
    lat (msec) : 2=0.01%, 4=0.07%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.19%, sys=0.53%, ctx=32832, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-2: (groupid=0, jobs=1): err= 0: pid=4420: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=667945B/s, iops=163, runt=200941msec
    clat (usec): min=3094, max=25628, avg=6119.27, stdev=399.66
     lat (usec): min=3095, max=25629, avg=6120.15, stdev=399.66
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7072], 99.90th=[ 8256], 99.95th=[ 8640],
     | 99.99th=[16192]
    bw (KB  /s): min=  538, max=  693, per=12.50%, avg=652.29, stdev=10.89
    lat (msec) : 4=0.07%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.12%, sys=0.57%, ctx=32812, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-3: (groupid=0, jobs=1): err= 0: pid=4421: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=667952B/s, iops=163, runt=200939msec
    clat (usec): min=3095, max=25370, avg=6118.51, stdev=398.32
     lat (usec): min=3096, max=25371, avg=6119.41, stdev=398.32
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8256], 99.95th=[ 8512],
     | 99.99th=[16192]
    bw (KB  /s): min=  546, max=  694, per=12.50%, avg=652.35, stdev=10.66
    lat (msec) : 4=0.07%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.21%, sys=0.51%, ctx=32828, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-4: (groupid=0, jobs=1): err= 0: pid=4422: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=667985B/s, iops=163, runt=200929msec
    clat (usec): min=3112, max=25337, avg=6118.50, stdev=398.07
     lat (usec): min=3112, max=25338, avg=6119.38, stdev=398.08
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6368], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8256], 99.95th=[ 8512],
     | 99.99th=[16192]
    bw (KB  /s): min=  556, max=  694, per=12.50%, avg=652.36, stdev=10.45
    lat (msec) : 4=0.07%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.15%, sys=0.56%, ctx=32812, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-5: (groupid=0, jobs=1): err= 0: pid=4423: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=668039B/s, iops=163, runt=200913msec
    clat (usec): min=2637, max=25297, avg=6118.96, stdev=398.35
     lat (usec): min=2639, max=25298, avg=6119.85, stdev=398.34
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8160], 99.95th=[ 8512],
     | 99.99th=[16192]
    bw (KB  /s): min=  584, max=  694, per=12.50%, avg=652.44, stdev= 9.87
    lat (msec) : 4=0.06%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.20%, sys=0.50%, ctx=32802, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-6: (groupid=0, jobs=1): err= 0: pid=4424: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=668235B/s, iops=163, runt=200854msec
    clat (usec): min=753, max=25258, avg=6117.93, stdev=409.49
     lat (usec): min=755, max=25259, avg=6118.83, stdev=409.48
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6368], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8160], 99.95th=[ 8640],
     | 99.99th=[16320]
    bw (KB  /s): min=  619, max=  718, per=12.51%, avg=652.82, stdev= 9.81
    lat (usec) : 1000=0.02%
    lat (msec) : 2=0.01%, 4=0.04%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.20%, sys=0.50%, ctx=32788, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-7: (groupid=0, jobs=1): err= 0: pid=4425: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=668251B/s, iops=163, runt=200849msec
    clat (usec): min=1016, max=25213, avg=6117.84, stdev=445.80
     lat (usec): min=1018, max=25214, avg=6118.72, stdev=445.79
    clat percentiles (usec):
     |  1.00th=[ 5280],  5.00th=[ 5472], 10.00th=[ 5600], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6624], 95.00th=[ 6752],
     | 99.00th=[ 7008], 99.50th=[ 7136], 99.90th=[ 8160], 99.95th=[ 8512],
     | 99.99th=[16064]
    bw (KB  /s): min=  620, max=  725, per=12.51%, avg=652.81, stdev= 9.94
    lat (msec) : 2=0.03%, 4=0.04%, 10=99.89%, 20=0.04%, 50=0.01%
  cpu          : usr=0.16%, sys=0.50%, ctx=32775, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-8: (groupid=0, jobs=1): err= 0: pid=4426: Fri Mar 11 01:52:56 2016
  read : io=131072KB, bw=668231B/s, iops=163, runt=200855msec
    clat (usec): min=1075, max=25203, avg=6118.23, stdev=407.86
     lat (usec): min=1077, max=25204, avg=6119.12, stdev=407.85
    clat percentiles (usec):
     |  1.00th=[ 5344],  5.00th=[ 5600], 10.00th=[ 5664], 20.00th=[ 5792],
     | 30.00th=[ 5920], 40.00th=[ 5984], 50.00th=[ 6112], 60.00th=[ 6240],
     | 70.00th=[ 6304], 80.00th=[ 6432], 90.00th=[ 6560], 95.00th=[ 6688],
     | 99.00th=[ 6944], 99.50th=[ 7008], 99.90th=[ 8256], 99.95th=[ 8768],
     | 99.99th=[16320]
    bw (KB  /s): min=  620, max=  715, per=12.51%, avg=652.81, stdev= 9.76
    lat (msec) : 2=0.03%, 4=0.03%, 10=99.90%, 20=0.04%, 50=0.01%
  cpu          : usr=0.18%, sys=0.46%, ctx=32772, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=1024.0MB, aggrb=5218KB/s, minb=652KB/s, maxb=652KB/s, mint=200849msec, maxt=200949msec

Disk stats (read/write):
  mmcblk0: ios=262020/20, merge=0/5, ticks=1596120/420, in_queue=1596280, util=100.00%