fio4pi/results/6409-2r-rpi2-raspbian_v4.1.18-v7+.log
random-read-1: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-read-2: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 2 processes
random-read-1: Laying out IO file(s) (1 file(s) / 128MB)
random-read-2: Laying out IO file(s) (1 file(s) / 128MB)

random-read-1: (groupid=0, jobs=1): err= 0: pid=2970: Thu Mar 10 22:28:06 2016
  read : io=131072KB, bw=4860.5KB/s, iops=1215, runt= 26967msec
    clat (usec): min=527, max=6032, avg=802.22, stdev=118.65
     lat (usec): min=530, max=6034, avg=803.82, stdev=118.64
    clat percentiles (usec):
     |  1.00th=[  748],  5.00th=[  772], 10.00th=[  772], 20.00th=[  780],
     | 30.00th=[  788], 40.00th=[  788], 50.00th=[  796], 60.00th=[  796],
     | 70.00th=[  804], 80.00th=[  812], 90.00th=[  820], 95.00th=[  820],
     | 99.00th=[  876], 99.50th=[ 1384], 99.90th=[ 2288], 99.95th=[ 3568],
     | 99.99th=[ 4128]
    bw (KB  /s): min= 4736, max= 4952, per=50.06%, avg=4865.66, stdev=55.30
    lat (usec) : 750=0.98%, 1000=98.30%
    lat (msec) : 2=0.42%, 4=0.29%, 10=0.01%
  cpu          : usr=2.26%, sys=7.38%, ctx=32961, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-read-2: (groupid=0, jobs=1): err= 0: pid=2971: Thu Mar 10 22:28:06 2016
  read : io=131072KB, bw=4859.8KB/s, iops=1214, runt= 26971msec
    clat (usec): min=490, max=5953, avg=802.07, stdev=119.78
     lat (usec): min=492, max=5955, avg=803.68, stdev=119.77
    clat percentiles (usec):
     |  1.00th=[  748],  5.00th=[  764], 10.00th=[  772], 20.00th=[  780],
     | 30.00th=[  788], 40.00th=[  788], 50.00th=[  796], 60.00th=[  796],
     | 70.00th=[  804], 80.00th=[  812], 90.00th=[  820], 95.00th=[  820],
     | 99.00th=[  884], 99.50th=[ 1384], 99.90th=[ 2320], 99.95th=[ 3568],
     | 99.99th=[ 4384]
    bw (KB  /s): min= 4736, max= 4960, per=50.05%, avg=4864.75, stdev=57.95
    lat (usec) : 500=0.01%, 750=0.93%, 1000=98.33%
    lat (msec) : 2=0.44%, 4=0.28%, 10=0.01%
  cpu          : usr=3.63%, sys=5.82%, ctx=32887, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=9719KB/s, minb=4859KB/s, maxb=4860KB/s, mint=26967msec, maxt=26971msec

Disk stats (read/write):
  mmcblk0: ios=65406/0, merge=0/0, ticks=49300/0, in_queue=49220, util=99.78%