fio4pi/results/6410-1r-rpi3-raspbian_v4.1.18-v7+.log
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 1 process
random-read: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=3130: Mon Mar 14 15:42:33 2016
  read : io=131072KB, bw=2977.2KB/s, iops=744, runt= 44026msec
    clat (usec): min=557, max=2597.4K, avg=1333.12, stdev=14354.06
     lat (usec): min=558, max=2597.4K, avg=1334.09, stdev=14354.06
    clat percentiles (usec):
     |  1.00th=[ 1080],  5.00th=[ 1128], 10.00th=[ 1144], 20.00th=[ 1192],
     | 30.00th=[ 1208], 40.00th=[ 1224], 50.00th=[ 1240], 60.00th=[ 1240],
     | 70.00th=[ 1256], 80.00th=[ 1256], 90.00th=[ 1288], 95.00th=[ 1320],
     | 99.00th=[ 1352], 99.50th=[ 1384], 99.90th=[14016], 99.95th=[14016],
     | 99.99th=[14144]
    bw (KB  /s): min=  298, max= 3320, per=100.00%, avg=3130.59, stdev=322.37
    lat (usec) : 750=0.05%, 1000=0.04%
    lat (msec) : 2=99.63%, 4=0.05%, 10=0.01%, 20=0.22%, >=2000=0.01%
  cpu          : usr=0.82%, sys=1.73%, ctx=55879, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=2977KB/s, minb=2977KB/s, maxb=2977KB/s, mint=44026msec, maxt=44026msec

Disk stats (read/write):
  mmcblk0: ios=32571/17, merge=0/4, ticks=42720/31190, in_queue=73880, util=97.37%